Revit 2027 API
TableSectionData.ResetCellOverride(Int32, Int32) Method
 Resets the override of the cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetCellOverride(
	int nRow,
	int nCol
)
Public Sub ResetCellOverride (
	nRow As Integer,
	nCol As Integer
)
public:
void ResetCellOverride(
	int nRow,
	int nCol
)
member ResetCellOverride :
        nRow : int *
        nCol : int -> unit
Parameters
nRow Int32
nCol Int32
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- Only allow to override cell style for header section or column header in body section.
See Also
Reference
TableSectionData Class
ResetCellOverride Overload
Autodesk.Revit.DB Namespace